{
	"gdprGuard": {
		"features": {
			"name": "Fonctionnalité",
			"description": "Données nécessaires au fonctionnement global du site"
		},
		"i18n_redirected": {
			"name": "i18n_redirected",
			"description": "Sauvegarde de la langue actuelle"
		},

		"RGPD": {
			"name": "GDPR",
			"description": "Gestion des préférences relatives à la protection des données"
		},
		"gdpr": {
			"name": "gdpr",
			"description": "Sauvegarde de vos préférences RGPD"
		},
		"gdpr__version": {
			"name": "gdpr__version",
			"description": "Version des préférences RGPD"
		}
	},
	"projects": {
		"website": {
			"title": "Site officiel",
			"description": "Mon site statique. Progressive Web App réalisée via l'écosystème Vue. Reposant précédemment sur Vue CLI, il a été récemment migré vers Nuxt 2. Bien que pour l'instant cordonnier mal chaussé, une version 2 est en préparation proposant un véritable site web complet et une charte graphique plus chattoyante."
		},
		"scientistOath": {
			"title": "Le serment du Scientifique",
			"description": "Un projet visant à fournir une généralisation du Serment d'Hippocrate à tous les scientifiques, y compris dans les métiers liés à l'informatique."
		},
		"kiplin": {
			"title": "Kiplin",
			"description": "Lutter contre la sédentarité et par le jeu, telle est la mission de Kiplin. C'est avec grand plaisir que j'ai pu, en tant qu'Intégrateur Web chez swimming pool, poser ma pierre à l'édifice qu'est la refonte de leur site web.",
			"url": "https://www.kiplin.com/fr/"
		},
		"monTaraud": {
			"title": "Projet Transversal (mon-taraud.com)",
			"description": "Site web utilitaire permettant de déterminer facilement les références produit d'un taraud à partir de ses dimensions. Réalisé dans le cadre de mes études à Polytech Nantes, sur toute une année. Le but du projet transversal étant de mettre les étudiants en situation réelle avec contact client, retours, etc&hellip;&nbsp;. Étant reponsable des choix techniques, le site a été réalisé en Vue et Adonis.",
			"urls": {
				"polytech": "https://polytech.univ-nantes.fr"
			}
		},
		"$json": {
			"title": "Client JSON ($json)",
			"description": "Client HTTP spécialisé dans les communications JSON permettant d'échanger facilement des données avec une API REST par exemple. Il s'agit en réalité d'une petite surcouche pour l'API Fetch."
		},
		"mvea": {
			"title": "MVEA",
			"description": "Patron d'architecture logicielle, variante de MVC, en cours de spécification. Il vise à augmenter la réutilisabilité des composants ainsi qu'à maximiser la séparation des responsabilités tout en intégrant et en spécifiant des pratiques récurrentes dans les applications MVC."
		},
		"validatueur": {
			"title": "Validatueur",
			"description": "Bibliothèque JavaScript d'aissainissement et de validation visant à être utilisable dans toute application, quelle que soit la complexité des formulaires. Destiné à pouvoir être utilisé à la fois pour la validation côté client (UX) et pour la validation côté serveur (sécurité)."
		},
		"gdprGuard": {
			"title": "GDPR Guard",
			"description": "Bibliothèque de gestion de préférences RGPD permettant un listing précis ainsi qu'une logique conditionnelle en fonction des paramètres enregistrés par l'utilisateur. Le but étant de permettre une flexibilité d'utilisation aussi bien du point de vue utilisateur que du point de vue développeur. À noter qu'il existe divers outils permettant l'intégration de la bibliothèque avec d'autres technologies (e.g. frameworks front-end)."
		},
		"lightquery": {
			"title": "Lightquery",
			"description": "Mon premier projet Open Source, une alternative plus légère et plus moderne à jQuery. Réécrit entièrement en 2020 pour proposer une véritable alternative propre et légère."
		},
		"lazyCollection": {
			"title": "Lazy collection",
			"description": "Bibliothèque de manipulation de collections en PHP favorisant l'expressivité tout en gardant une complexité linéaire indépendamment du nombre d'opérations."
		}
	}
}
